InformationRegisters/БлокировкаЗаказНарядов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>БлокировкаЗаказНарядов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаБлокировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияБлокировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстовоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/БлокировкаЗаказНарядов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Функция - Проверка наличия блокировки от изменений документа
//
// Параметры:
//  ДокументЗаказНаряд	 - ДокументСсылка.ЗаказНаряд - Документ, для которого производиться проверка блокировки.
// 
// Возвращаемое значение:
//   - Данные о блокировки документа.
//
Функция ПроверкаБлокировкиИзменений(ДокументЗаказНаряд) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ДокументЗаказНаряд) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	БлокировкаЗаказНарядов.ДатаБлокировки КАК ДатаБлокировки,
	               |	БлокировкаЗаказНарядов.ДатаСнятияБлокировки КАК ДатаСнятияБлокировки,
	               |	БлокировкаЗаказНарядов.Пользователь КАК Пользователь,
	               |	БлокировкаЗаказНарядов.ТекстовоеОписание КАК ТекстовоеОписание
	               |ИЗ
	               |	РегистрСведений.БлокировкаЗаказНарядов КАК БлокировкаЗаказНарядов
	               |ГДЕ
	               |	БлокировкаЗаказНарядов.ЗаказНаряд = &ЗаказНаряд
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаСнятияБлокировки УБЫВ";
	Запрос.УстановитьПараметр("ЗаказНаряд", ДокументЗаказНаряд);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() > 0 Тогда
		
		Если Не ЗначениеЗаполнено(Выборка[Выборка.Количество() - 1].ДатаСнятияБлокировки) Тогда
			
			// По незаполненной дате блокировки
			Результат.Добавить(Выборка[Выборка.Количество() - 1]);
			
		ИначеЕсли Выборка[0].ДатаСнятияБлокировки > ТекущаяДатаСеанса() Тогда
			
			// По крайней дате блокировки
			Результат.Добавить(Выборка[0]);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПроверкаБлокировкиИзменений()

#Область ПараметрыОбработкиРеквизитовОбъекта

Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции 

Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	УникальныеРеквизиты = Новый Структура();
	
	Возврат УникальныеРеквизиты;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
